Reconcile 루프 박스 수정
